{
    "iteration times": [
        1528902788.069775
    ], 
    "iterations": [
        {
            "removed keywords": [], 
            "thumbnails": {
                "search time": 1528902749.27596, 
                "thumbnails info": [
                    {
                        "image url": "https://futureoflife.org/background/benefits-risks-of-artificial-intelligence/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRM-S5EbU3-31bvM-41X_S4X7UJ1EZgpj6dvQnBMsHv4dh3BubaYbHdP3s"
                    }, 
                    {
                        "image url": "http://robohub.org/artificial-intelligence-understanding-how-machines-learn/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRvDItl3Fe0o9_U6KA2yyoxMJ_xOxJxheZFlxfNQgssCdRbezjYWpH3sLQV"
                    }, 
                    {
                        "image url": "https://www.news-medical.net/news/20180305/Study-identifies-new-learning-approach-for-artificial-intelligence.aspx", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQnQC5R7Ft91NZi7mXzJJhUMygWEBfUVoKp1OAgWF9J_bKIlSoPRCYWtBk"
                    }, 
                    {
                        "image url": "https://www.gettyimages.com/illustrations/artificial-intelligence", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRqKgdUmM6VWbHyoA31pPfT00eI9BYj3QI9uv6wsuW6xaL2VHS5QdEsQskd"
                    }, 
                    {
                        "image url": "https://www.clicksoftware.com/blog/adventures-in-artificial-intelligence-part-1-defining-ai/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTcE7DoRDSfyfy5bcJGCGbkI5Fu8SEAmgkwpckdZ9YXWej1uHIu7rpr9p0"
                    }, 
                    {
                        "image url": "https://www.collective-evolution.com/2015/06/17/can-we-really-trust-artificial-intelligence/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSCeLo0ekSad5jXZRo9Twt7r1iZYbUqFUCr7KM-fZzS-KbrL66MNNJ0IDu0"
                    }, 
                    {
                        "image url": "http://www.gettingsmart.com/2017/09/artificial-intelligence-in-education-dont-ignore-it-harness-it/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRPyaGEOxj7GTnwyIGoi0E4JNsyHspnQcULkviunWsCbHLN_otp26cn-PTt"
                    }, 
                    {
                        "image url": "https://medium.com/%40KodiakRating/6-applications-of-artificial-intelligence-for-your-supply-chain-b82e1e7400c8", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ0uDx3pQMj7fw2N6ZeBdNvzkxUGXjPI4m2QlSnONZxD1Tuz0AdbHC-vc2e"
                    }, 
                    {
                        "image url": "http://allevi8marketing.com/artificial-intelligence-small-business/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRgVrzNAKWy5e8riQDcFSyMLNPK-z1WozaFz5o6-QYL6SWsQGABeMDzhqI"
                    }, 
                    {
                        "image url": "https://www.anythingarticles.com/artificial-intelligence-in-mobile-apps/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSp02JMmjL9p3X3l-TTz8igES3gkhDXXn8gexsGD4vfFtQKZ42iJ3lv5nRa"
                    }, 
                    {
                        "image url": "https://ischool.syr.edu/infospace/2017/08/23/artificial-intelligence-what-can-go-wrong/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTpbvgeru7kKG8gYnaWgSuVlGDn0lMZELwoWC1R1mUpxZDSP-4VPKaN3teJ"
                    }, 
                    {
                        "image url": "https://towardsdatascience.com/artificial-intelligence-fundamentals-making-machine-intelligent-d3f28f236c7", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSwS4inZgNdD-FfTVOgYvYa0IDdZDNwux7kkogbJKtSe2hlEaGicx5i0bEi"
                    }, 
                    {
                        "image url": "https://securityintelligence.com/news/security-intelligence-analytics-trends-artificial-intelligence-plays-both-sides/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR1_7UnwJVHI1gVOJMQnlzVRYmt7f7y_sdKaoCadPljlQA_gG5p2I6MUY0K"
                    }, 
                    {
                        "image url": "https://www.simplilearn.com/what-is-artificial-intelligence-and-why-ai-certification-article", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSZZA9qx5zyq61qmciJSEjNZNe1H6a2AdVgV-HkPHct5cZx8zIwKAEN1Pk"
                    }, 
                    {
                        "image url": "https://www.forbesmiddleeast.com/en/artificial-intelligence-to-contribute-320-billion-to-the-middle-east-by-2030/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTBYUKgIfDdASMO7aZZioPWZXQoXOoLQnYrTZLoGgljJw2cv7tNqbAHPT6N"
                    }, 
                    {
                        "image url": "https://www.telegraph.co.uk/news/2018/01/23/have-just-one-shot-taming-artificial-intelligence-genie-britain/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRw0g8TXEgDv2AXYUC3yB8p5wZg50C7PYsoKpkWAHA4-4ESoVqQ8fLhu4DC"
                    }, 
                    {
                        "image url": "https://www.mckinsey.com/industries/capital-projects-and-infrastructure/our-insights/artificial-intelligence-construction-technologys-next-frontier", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQt5BEa3P5JRwoNfoDOKPC5p1-afR4QhxtLv--H3kSrsUu8EASTdZqzPDd8NA"
                    }, 
                    {
                        "image url": "https://www.zdnet.com/article/what-is-ai-everything-you-need-to-know-about-artificial-intelligence/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWB2Lx7xM3GcwdyEc2DBOuL960FNrx4rA2-mT8SFZLLO7JZ9DLaRyZPpA"
                    }, 
                    {
                        "image url": "https://blogs.opentext.com/impact-of-artificial-intelligence-on-insurance-industry/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQe42zGmqTrGviQHhqgGLzIq8FA-aj40mLIWSRkL5q5NCZPareQs20hi9k"
                    }, 
                    {
                        "image url": "https://sanvada.com/2018/01/20/programs-prove-artificial-intelligence-advanced-lot-imagine/", 
                        "thumbnail url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7HVBZJ3Ly8XHKy6KH6uQzUpMSleVs_NzSKqVfCRhiac35Bgyh34ATN_SI"
                    }
                ]
            }, 
            "items": [
                {
                    "time of visit": 1528902748.676236, 
                    "title": "News for artificial intelligence", 
                    "abstract": "", 
                    "text lines": "Over the next five years, we are about to witness the world we live in entirely \ndisrupted by improvements in artificial intelligence (AI) and ...", 
                    "link": "Forbes", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902748.775284, 
                    "title": "Artificial intelligence - Wikipedia", 
                    "abstract": "", 
                    "text lines": "Artificial intelligence (AI, also machine intelligence, MI) is intelligence demonstrated by machines, in contrast to the natural intelligence (NI) displayed by humans and other animals.", 
                    "link": "https://en.wikipedia.org/wiki/Artificial_intelligence", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902749.149797, 
                    "title": "Benefits & Risks of Artificial Intelligence - Future of Life Institute", 
                    "abstract": "In the near term, the goal of keeping AI’s impact on society beneficial motivates research in many areas, from economics and law to technical topics such as verification, validity, security and control. Whereas it may be little more than minor nuisance if your laptop crashes or gets hacked, it becomes all the more important that an AI system does what you want it to do if it controls your car, your airplane, your pacemaker, your automated trading system or your power grid. Another short-term challenge is preventing devastating There are some who question whether strong AI will ever be achieved, and others who insist that the creation of superintelligent AI is guaranteed to be beneficial. At FLI we recognize both of these possibilities, but also recognize the potential for an artificial intelligence system to intentionally or unintentionally cause great harm. We believe research today will help us better prepare for and prevent such potentially negative consequences in the future, thus enjoying the benefits of AI while avoiding pitfalls. Autonomous weapons are artificial intelligence systems that are programmed to kill. In the hands of the wrong person, these weapons could easily cause mass casualties. Moreover, an AI arms race could inadvertently lead to an AI war that also results in mass casualties. To avoid being thwarted by the enemy, these weapons would be designed to be extremely difficult to simply so humans could plausibly lose control of such situation. This risk is one that’s present even with narrow AI, but grows as levels of AI intelligence and autonomy increase. This can happen whenever we fail to fully align the AI’s goals with ours, which is strikingly difficult. If you ask an obedient intelligent car to take you to the airport as fast as possible, it might get you there chased by helicopters and covered in vomit, doing not what you wanted but literally what you asked for. If superintelligent system is tasked with ambitious geoengineering project, it might wreak havoc with our ecosystem as side effect, and view human to stop it as threat to be met. super-intelligent AI will be extremely good at accomplishing its goals, and if those goals aren’t aligned with ours, we have problem. You’re probably not an evil ant-hater who steps on ants out of malice, but if you’re in charge of hydroelectric green energy project and there’s an anthill in the region to be flooded, too bad for the ants. key goal of AI safety research is to never place humanity in the position of those ants. The idea that the quest for strong AI would ultimately succeed was long thought of as science fiction, centuries or more away. However, thanks to recent many AI milestones, which experts viewed as decades away merely five years ago, have now been reached, making many experts take seriously the possibility of superintelligence in our lifetime. Because AI has the potential to become more intelligent than any human, we have no surefire way of predicting how it will behave. We can’t use past technological developments as much of basis because we’ve never created anything that has the ability to, wittingly or unwittingly, outsmart us. The best example of what we could face may be our own evolution. People now control the planet, not because we’re the strongest, fastest or biggest, but because we’re the smartest. If we’re no longer the smartest, are we assured to remain in control? FLI’s position is that our civilization will flourish as long as we win the race between the growing power of technology and the wisdom with which we manage it. In the case of AI technology, FLI’s position is that the best way to win that race is not to impede the former, but to accelerate the latter, by supporting AI safety research. captivating conversation is taking place about the future of artificial intelligence and what it will/should mean for humanity. There are fascinating controversies where the world’s leading experts disagree, such as: AI’s future impact on the job market; if/when human-level AI will be developed; whether this will lead to an intelligence explosion; and whether this is something we should welcome or fear. But there are also many examples of of boring pseudo-controversies caused by people misunderstanding and talking past each other. To help ourselves focus on the interesting controversies and open questions and not on the misunderstandings let’s clear up some of the most common myths. One popular myth is that we know we’ll get superhuman AI this century. In fact, history is full of technological over-hyping. Where are those fusion power plants and flying cars we were promised we’d have by now? AI has also been repeatedly over-hyped in the past, even by some of the founders of the field. For example, John McCarthy coined the term Marvin Minsky, Nathaniel Rochester and Claude Shannon wrote this overly optimistic forecast about what could be accomplished during two with stone-age computers: An attempt will be made to find how to make machines use language, form and concepts, solve kinds of problems now reserved for humans, and improve themselves. We think that significant advance can be made in one or more of these problems if carefully selected group of scientists work on it together for On the other hand, popular counter-myth is that we know we won’t get superhuman AI this century. Researchers have made wide range of estimates for how far we are from superhuman AI, but we certainly can’t say with great confidence that the probability is zero this century, given the dismal track record of such techno-skeptic predictions. For example, Ernest Rutherford, arguably the greatest nuclear physicist of his time, said in less than hours before Szilard’s invention of the nuclear chain reaction that nuclear energy was And Astronomer Royal Richard Woolley called interplanetary travel bilge” in The most extreme form of this myth is that superhuman AI will never arrive because it’s physically impossible. However, physicists know that brain consists of quarks and electrons arranged to act as powerful computer, and that there’s no law of physics preventing us from building even more intelligent quark blobs. There have been number of surveys asking AI researchers how many years from now they think we’ll have human-level AI with at least probability. All these surveys have the same conclusion: the world’s leading experts disagree, so we simply don’t know. For example, in such poll of the AI researchers at the There’s also related myth that people who worry about AI think it’s only few years away. In fact, most people on record worrying about superhuman AI guess it’s still at least decades away. But they argue that as long as we’re not sure that it won’t happen this century, it’s smart to start safety research now to prepare for the eventuality. Many of the safety problems associated with human-level AI are so hard that they may take decades to solve. So it’s prudent to start researching them now rather than the night before some programmers drinking Red Bull decide to switch one on. the audience laughed loudly. related misconception is that supporting AI safety research is hugely controversial. In fact, to support modest investment in AI safety research, people don’t need to be convinced that risks are high, merely non-negligible just as modest investment in home insurance is justified by non-negligible probability of the home burning down. It may be that media have made the AI safety debate seem more controversial than it really is. After all, fear sells, and articles using out-of-context quotes to proclaim imminent doom can generate more clicks than nuanced and balanced ones. As result, two people who only know about each other’s positions from media quotes are likely to think they disagree more than they really do. For example, techno-skeptic who only read about Bill Gates’s position in British tabloid may mistakenly think Gates believes superintelligence to be imminent. Similarly, someone in the beneficial-AI movement who knows nothing about Andrew Ng’s position except his quote about overpopulation on Mars may mistakenly think he doesn’t care about AI safety, whereas in fact, he does. The crux is simply that because Ng’s timeline estimates are longer, he naturally tends to prioritize short-term AI challenges over long-term ones. And as many have lost count of how many similar articles they’ve seen. Typically, these articles are accompanied by an evil-looking robot carrying weapon, and they suggest we should worry about robots rising up and killing us because they’ve become conscious and/or evil. On lighter note, such articles are actually rather impressive, because they summarize the scenario that AI researchers But does self-driving car have subjective experience? Does it feel like anything at all to be self-driving car? Although this mystery of consciousness is interesting in its own right, it’s irrelevant to AI risk. If you get struck by driverless car, it makes no difference to you whether it subjectively feels conscious. In the same way, what will affect us humans is what superintelligent AI The fear of machines turning evil is another red herring. The real worry isn’t malevolence, but competence. superintelligent AI is by definition very good at attaining its goals, whatever they may be, so we need to ensure that its goals are aligned with ours. Humans don’t generally hate ants, but we’re more intelligent than they are so if we want to build hydroelectric dam and there’s an anthill there, too bad for the ants. The beneficial-AI movement wants to avoid placing humanity in the position of those ants. The consciousness misconception is related to the myth that machines can’t have goals. Machines can obviously have goals in the narrow sense of exhibiting goal-oriented behavior: the behavior of heat-seeking missile is most economically explained as goal to hit target. If you feel threatened by machine whose goals are misaligned with yours, then it is precisely its goals in this narrow sense that troubles you, not whether the machine is conscious and experiences sense of purpose. If that heat-seeking missile were chasing you, you probably wouldn’t exclaim: sympathize with Rodney Brooks and other robotics pioneers who feel unfairly demonized by scaremongering tabloids, because some journalists seem obsessively fixated on robots and adorn many of their articles with evil-looking metal monsters with red shiny eyes. In fact, the main concern of the beneficial-AI movement isn’t with robots but with intelligence itself: specifically, intelligence whose goals are misaligned with ours. To cause us trouble, such misaligned superhuman intelligence needs no robotic body, merely an internet connection this may enable outsmarting financial markets, out-inventing human researchers, out-manipulating human leaders, and developing weapons we cannot even understand. Even if building robots were physically impossible, super-intelligent and super-wealthy AI could easily pay or manipulate many humans to unwittingly do its bidding. Not wasting time on the above-mentioned misconceptions lets us focus on true and interesting controversies where even the experts disagree. What sort of future do you want? Should we develop lethal autonomous weapons? What would you like to happen with job automation? What career advice would you give today’s kids? Do you prefer new jobs replacing the old ones, or jobless society where everyone enjoys life of leisure and machine-produced wealth? Further down the road, would you like us to create superintelligent life and spread it through our cosmos? Will we control intelligent machines or will they control us? Will intelligent machines replace us, coexist with us, or merge with us? What will it mean to be human in the age of artificial intelligence? What would you like it to mean, and how can we make the future be that way? Please join the conversation! The philosophy of Arthur Schopenhauer convincingly shows that the his i.e. an innate drive, is at the basis of human behaviour. Our cognitive apparatus has evolved as of that Any attempt to interpret human behaviour as primarily system of computing mechanisms and our brain as sort of computing apparatus is therefore doomed to failure. See here: read about Obama’s support for the brain research initiatives several ago with some interest. It even mildly sounded good; there are checks and balances ingrained in the systems of public funding for research, right from the application for funding, through grant approval, scope validation and ethics approval to the conduct of the research; there are systematic reviews of the methods and findings to spot weaknesses that would compromise the safety of the principles and the people involved; there are processes to evolve the checks and balances to ensure the continued safety of such principles and the people. The of the FDA, the MDD, the TGA and their likes in the developing nations is testament to how the rigor of the conduct of the research and the regulations grow together so another initiative such as the development of atomic bomb are nibbled before they so much as think of And then read about the enormous engagement of the global software industry in the areas of Artificial Intelligence and Neuroscience. Theses are technological giants who sell directly to the consumers infatuated with technology more than anything else. they are pouring their efforts into artificial intelligence research for reasons as many as the number of individual engineering teams that’s charged to cross mm of their mile long project plan! I’d be surprised if if any one of them has the bandwidth to think beyond the mm that they have to cross, let alone the consequences of their collective effort on human Given the pace of the industry’s engagement, believe there is an immediate need for Bio-signal interface technical standards to be developed and established. These standards would serve as to preserve the simple fact upon which every justice system in the world has been built the brain and nervous system of an individual belongs to an individual and is not to be accessed by other individuals or machines with out stated consent for stated purposes. The standards will identify the frequency bands or pulse trains for exclusion in all research tools- software or otherwise, commercially available products, regulated devices, tools of trade, and communication infrastructure such that inadvertent breech of barriers to an individual’s brain and nervous system is prohibited. The standards will form basis for international telecommunication infrastructure satellites and cell phone towers) to enforce compliance by electronically blocking and monitoring offending signals. Typically such standards are developed by international organizations with direct or indirect representation from industry stakeholders and adopted by the regulators of various countries over period of one or more years. Subsequently they are adopted by the industry. The risk of noncompliance is managed on case by case basis the timing determinant on the extent of impact. Unfortunately this model will not be adequate for cutting edge technology with the ability to cause irreversible damage to the very fabric of the human society, if the technology becomes commonplace before the development of the necessary checks and balances. Development of tools to study the brain using electromagnetic energy based technology based on state of the art commercial telecommunication infrastructure is one such example. What we need is leadership to engage the regulators, academics as well as prominent players in the industry in the development of standards and sustainable solutions to enforce compliance and monitoring. From my simple-minded perspective and connecting the dots to what seems logical conclusion, we will soon live in world bursting at the seams with overpopulation, where an individual has no marketable skill and is social and economic liability to the few who own either technology or hard assets. This in turn will lead to giant lower class, no middle class and few elites who own the planet unlike the direction we are already What if the that be” greatest fear is the emergence of super AI that police’s and rationalizes the distribution of wealth and food. friendly super AI that is programmed to help humanity by, enforcing the declaration of Human US is the only industrialized country that to this day has not signed this declaration) ending corruption and racism and protecting the environment.", 
                    "text lines": "Why do we need research to ensure that artificial intelligence remains safe and \nbeneficial? What are the benefits and risks of artificial intelligence?", 
                    "link": "https://futureoflife.org/background/benefits-risks-of-artificial-intelligence/", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902749.846759, 
                    "title": "The Business of Artificial Intelligence - Harvard Business Review", 
                    "abstract": "For more than years the fundamental drivers of economic growth have been technological innovations. The most important of these are what economists call general-purpose technologies category that includes the steam engine, electricity, and the internal combustion engine. Each one catalyzed waves of complementary innovations and opportunities. The internal combustion engine, for example, gave rise to cars, trucks, airplanes, chain saws, and lawnmowers, along with big-box retailers, shopping centers, cross-docking warehouses, new supply chains, and, when you think about it, suburbs. Companies as diverse as Walmart, UPS, and Uber found ways to leverage the technology to create profitable new business models. The most important general-purpose technology of our era is artificial intelligence, particularly machine learning that is, the machine’s ability to keep improving its performance without humans having to explain exactly how to accomplish all the tasks it’s given. Within just the past few years machine learning has become far more effective and widely available. We can now build systems that learn how to perform tasks on their own. Why is this such big deal? Two reasons. First, we humans know more than we can tell: We can’t explain exactly how we’re able to do lot of things from recognizing face to making smart move in the ancient Asian strategy game of Go. Prior to ML, this inability to articulate our own knowledge meant that we couldn’t automate many tasks. Now we can. In the sphere of business, AI is poised have transformational impact, on the scale of earlier general-purpose technologies. Although it is already in use in thousands of companies around the world, most big opportunities have not yet been tapped. The effects of AI will be magnified in the coming decade, as manufacturing, retailing, transportation, finance, health care, law, advertising, insurance, entertainment, education, and virtually every other industry transform their core processes and business models to take advantage of machine learning. The bottleneck now is in management, implementation, and business imagination. is the director of MIT’s Initiative on the Digital Economy, the Schussel Family Professor of Management Science at the MIT Sloan School of Management, and research associate at NBER. His research examines the effects of information technologies on business strategy, productivity and performance, digital commerce, and intangible assets. At MIT he teaches courses on the economics of information and the Analytics Lab. was among the first researchers to measure IT’s productivity contributions and the complementary role of organizational capital and other intangibles. His research provided the first quantification of online product variety value, known as the and developed pricing and bundling models for information goods. He earned his AB and his SM in applied mathematics and decision sciences at Harvard and his PhD in managerial economics at the Sloan School. Like so many other new technologies, however, AI has generated lots of unrealistic expectations. We see business plans liberally sprinkled with references to machine learning, neural nets, and other forms of the technology, with little connection to its real capabilities. Simply calling dating site for example, doesn’t make it any more effective, but it might help with fundraising. This article will cut through the noise to describe the real potential of AI, its practical implications, and the barriers to its adoption. Let’s start by exploring what AI is already doing and how quickly it is improving. The biggest advances have been in two broad areas: perception and cognition. In the former category some of the most practical advances have been made in relation to speech. Voice recognition is still far from perfect, but millions of people are now using it think Siri, Alexa, and Google Assistant. The text you are now reading was originally dictated to computer and with sufficient accuracy to make it faster than typing. by the Stanford computer scientist James Landay and colleagues found that speech recognition is now about three times as fast, on average, as typing on cell phone. The error rate, once has dropped to What’s striking is that this substantial improvement has come not over the past years but just since the summer of Image recognition, too, has improved dramatically. You may have noticed that Facebook and other apps now recognize many of your friends’ faces in posted photos and prompt you to tag them with their names. An app running on your will recognize virtually any bird in the wild. Image recognition is even replacing ID cards at corporate headquarters. Vision systems, such as those used in self-driving cars, formerly made mistake when identifying pedestrian as often as once in frames cameras in these systems record about frames now they err less often than once in million frames. The error rate for recognizing images from large database called ImageNet, with several million photographs of common, obscure, or downright weird images, fell from higher than in to about in for the best systems. the exhibit or The speed of improvement has accelerated rapidly in recent years as new approach, based on very large or neural nets, was adopted. The ML approach for vision systems is still far from flawless but even people have trouble quickly recognizing puppies’ faces or, more embarrassingly, see their cute faces where none exist. The second type of major improvement has been in cognition and problem solving. Machines have already beaten the finest players of poker and Go achievements that experts had predicted would take at least another decade. Google’s DeepMind team has used ML systems to improve the cooling efficiency at data centers by more than even after they were optimized by human experts. Intelligent agents are being used by the cybersecurity company Deep Instinct to detect malware, and by PayPal to prevent money laundering. system using IBM technology automates the claims process at an insurance company in Singapore, and system from Lumidatum, data science platform firm, offers timely advice to improve customer support. Dozens of companies are using ML to decide which trades to execute on Wall Street, and more and more credit decisions are made with its help. Amazon employs ML to optimize inventory and improve product recommendations to customers. Infinite Analytics developed one ML system to predict whether user would click on particular ad, improving online ad placement for global consumer packaged goods company, and another to improve customers’ search and discovery process at Brazilian online retailer. The first system increased advertising ROI threefold, and the second resulted in million increase in annual revenue. Machine learning systems are not only replacing older in many applications, but are now superior at many tasks that were once done best by humans. Although the systems are far from perfect, their error rate about on the ImageNet database is at or better than human-level performance. Voice recognition, too, even in noisy environments, is now nearly equal to human performance. Reaching this threshold opens up vast new possibilities for transforming the and the economy. Once AI-based systems surpass human performance at given task, they are much likelier to spread quickly. For instance, Aptonomy and Sanbot, makers respectively of drones and robots, are using improved vision systems to automate much of the work of security guards. The software company Affectiva, among others, is using them to recognize emotions such as joy, surprise, and anger in focus groups. And Enlitic is one of several deep-learning startups that use them to scan medical images to help diagnose cancer. These are impressive achievements, but the applicability of AI-based systems is still quite narrow. For instance, their remarkable performance on the ImageNet database, even with its millions of images, doesn’t always translate into similar success the where lighting conditions, angles, image resolution, and context may be very different. More fundamentally, we can marvel at system that understands Chinese speech and translates it into English, but we don’t expect such system to know what particular Chinese character means let alone where to eat in Beijing. If someone performs task well, it’s natural to assume that the person has some competence in related tasks. But ML systems are trained to do specific tasks, and typically their knowledge does not generalize. The fallacy that computer’s narrow understanding implies broader understanding is perhaps the biggest source of confusion, and exaggerated claims, about AI’s progress. We are far from machines that exhibit general intelligence across diverse domains. The most important thing to understand about ML is that it represents fundamentally different approach to creating software: The machine learns from examples, rather than being explicitly programmed for particular outcome. This is an important break from previous practice. For most of the past years, advances in information technology and its applications have focused on codifying existing knowledge and procedures and embedding them in machines. Indeed, the term denotes the painstaking process of transferring knowledge from developers’ heads into form that machines can understand and execute. This approach has fundamental weakness: Much of the knowledge we all have is tacit, meaning that we can’t fully explain it. It’s nearly impossible for us to write down that would enable another person to learn how to ride bike or to recognize friend’s face. TOP IMAGE: What does it mean to be human? What do we recognize as artificial? The art for this series was generated from series of photographs of humans, but because of an application of distortion, you may not recognize the features they portray. Or you may. HBR Design Staff) In other words, we all know more than we can tell. This fact is so important that it has name: Polanyi’s Paradox, for the philosopher and polymath Michael Polanyi, who described it in Polanyi’s Paradox not only limits what we can tell one another but has historically placed fundamental restriction on our ability to endow machines with intelligence. For long time that limited the activities that machines could productively perform in the economy. Artificial intelligence and machine learning come in many flavors, but most of the successes in recent years have been in one category: supervised learning systems, in which the machine is given lots of examples of the correct answer to particular problem. This process almost always involves mapping from set of inputs, X, to set of outputs, Y. For instance, the inputs might be pictures of various animals, and the correct outputs might be labels for those animals: dog, cat, horse. The inputs could also be waveforms from sound recording and the outputs could be words: the exhibit Learning Successful systems often use training set of data with thousands or even millions of examples, each of which has been labeled with the correct answer. The system can then be let loose to look at new examples. If the training has gone well, the system will predict answers with high rate of accuracy. which uses neural networks. Deep learning have significant advantage over earlier generations of ML They can make better use of much larger data sets. The old systems would improve as the number of examples in the training data grew, but only up to point, after which additional data didn’t lead to better predictions. According to Andrew Ng, one of the giants of the field, deep neural nets don’t seem to level off in this way: More data leads to better and better predictions. Some very large systems are trained by using Any situation in which you have lot of data on behavior and are trying to predict an outcome is potential application for supervised learning systems. Jeff Wilke, who leads Amazon’s consumer business, says that supervised learning systems have largely replaced the memory-based filtering that were used to make personalized recommendations to customers. In other cases, classic for setting inventory levels and optimizing supply chains have been replaced by more efficient and robust systems based on machine learning. JPMorgan Chase introduced system for supervised ones, at least for now. Unsupervised learning systems seek to learn on their own. We humans are excellent unsupervised learners: We pick up most of our knowledge of the world as how to recognize tree) with little or no labeled data. But it is exceedingly difficult to develop successful machine learning system that works this way. If and when we learn to build robust unsupervised learners, exciting possibilities will open up. These machines could look at complex problems in fresh ways to help us discover patterns in the spread of diseases, in price moves across securities in market, in customers’ purchase behaviors, and so on that we are currently unaware of. Such possibilities lead Yann LeCun, the head of AI research at Facebook and professor at NYU, to compare supervised learning systems to the frosting on the cake and unsupervised learning to the cake itself. This approach is embedded in systems that have mastered Atari video games and board games like Go. It is also helping to optimize data center power usage and to develop trading strategies for the stock market. Robots created by Kindred use machine learning to identify and sort objects they’ve never encountered before, speeding up the and place” process in distribution centers for consumer goods. In reinforcement learning systems the programmer specifies the current state of the system and the goal, lists allowable actions, and describes the elements of the environment that the outcomes for each of those actions. Using the allowable actions, the system has to figure out how to get as close to the goal as possible. These systems work well when humans can specify the goal but not necessarily how to get there. For instance, Microsoft used reinforcement learning to select headlines for MSN.com news stories by the system with higher score when more visitors clicked on the link. The system tried to maximize its score on the basis of the rules its designers gave it. Of course, this means that reinforcement learning system will optimize for the goal you explicitly reward, not necessarily the goal you really care about as lifetime customer so specifying the goal correctly and clearly is critical. There are three pieces of good news for organizations looking to put ML to use today. First, AI skills are spreading quickly. The world still has not nearly enough data scientists and machine learning experts, but the demand for them is being met by online educational resources as well as by universities. The best of these, including Udacity, Coursera, and fast.ai, do much more than teach introductory concepts; they can actually get smart, motivated students to the point of being able to create industrial-grade ML deployments. In addition to training their own people, interested companies can use online talent platforms such as Upwork, Topcoder, and Kaggle to find ML experts with verifiable expertise. The second welcome development is that the necessary and hardware for modern AI can be bought or rented as needed. Google, Amazon, Microsoft, Salesforce, and other companies are making powerful ML infrastructure available via the cloud. The competition among these rivals means that companies that want to experiment with or deploy ML will see more and more capabilities available at ever-lower prices over time. The final piece of good news, and probably the most underappreciated, is that you may not need all that much data to start making productive use of ML. The performance of most machine learning systems improves as they’re given more data to work with, so it seems logical to conclude that the company with the most data will win. That might be the case if means the global market for single application such as ad targeting or speech But if success is defined instead as significantly improving performance, then sufficient data is often surprisingly easy to obtain. For example, Udacity cofounder Sebastian Thrun noticed that some of his salespeople were much more effective than others when replying to inbound queries in chat room. Thrun and his graduate student Zayd Enam realized that their chat room logs were essentially set of labeled training data exactly what supervised learning system needs. Interactions that led to sale were labeled successes, and all others were labeled failures. Zayd used the data to predict what answers successful salespeople were likely to give in response to certain very common inquiries and then shared those predictions with the other salespeople to nudge them toward better performance. After training cycles, the salespeople had increased their effectiveness by and were able to serve twice as many customers at time. The AI startup WorkFusion takes similar approach. It works with companies to bring higher levels of automation to back-office processes such as paying international invoices and settling large trades between financial institutions. The reason these processes haven’t been automated yet is that they’re complicated; relevant information isn’t always presented the same way every time do we know what currency they’re talking and some interpretation and judgment are necessary. WorkFusion’s software watches in the as people do their work and uses their actions as training data for the cognitive task of classification invoice is in dollars. This one is in yen. This one is in Once the system is confident enough in its classifications, it takes over the process. Machine learning is driving changes at three levels: tasks and occupations, business processes, and business models. An example of task-and-occupation redesign is the use of machine vision systems to identify potential cancer cells freeing up radiologists to focus on truly critical cases, to communicate with patients, and to coordinate with other physicians. An example of process redesign is the reinvention of the and layout of Amazon fulfillment centers after the introduction of robots and optimization based on machine learning. Similarly, business models need to be rethought to take advantage of ML systems that can intelligently recommend music or movies in personalized way. Instead of selling songs la carte on the basis of consumer choices, better model might offer to personalized station that predicted and played music particular customer would like, even if the person had never heard it before. Note that machine learning systems hardly ever replace the entire job, process, or business model. Most often they complement human activities, which can make their work ever more valuable. The most effective rule for the new division of labor is rarely, if ever, all tasks to the Instead, if the successful completion of process requires steps, one or two of them may become automated while the rest become more valuable for humans to do. For instance, the chat room sales support system at Udacity didn’t try to build bot that could take over all the conversations; rather, it advised human salespeople about how to improve their performance. The humans remained in charge but became vastly more effective and efficient. This approach is usually much more feasible than trying to design machines that can do everything humans can do. It often leads to better, more satisfying work for the people involved and ultimately to better outcome for customers. Designing and implementing new combinations of technologies, human skills, and capital assets to meet customers’ needs requires large-scale creativity and planning. It is task that machines are not very good at. That makes being an entrepreneur or business manager one of society’s most rewarding jobs in the age of ML. The second wave of the second machine age brings with it new risks. In particular, machine learning systems often have low meaning that humans have difficulty figuring out how the systems reached their decisions. Deep neural networks may have hundreds of millions of connections, each of which contributes small amount to the ultimate decision. As result, these systems’ predictions tend to resist simple, clear explanation. Unlike humans, machines are not good storytellers. They can’t always give rationale for why particular applicant was accepted or rejected for job, or particular medicine was recommended. Ironically, even as we have begun to overcome Polanyi’s Paradox, we’re facing kind of reverse version: Machines know more than they can tell us. This creates three risks. First, the machines may have hidden biases, derived not from any intent of the designer but from the data provided to train the system. For instance, if system learns which job applicants to accept for an interview by using data set of decisions made by human recruiters in the past, it may inadvertently learn to perpetuate their racial, gender, ethnic, or other biases. Moreover, these biases may not appear as an explicit rule but, rather, be embedded in subtle interactions among the thousands of factors considered. second risk is that, unlike traditional systems built on explicit logic rules, neural network systems deal with statistical truths rather than literal truths. That can make it difficult, if not impossible, to prove with complete certainty that the system will work in all cases especially in situations that weren’t represented in the training data. Lack of verifiability can be concern in mission-critical applications, such as controlling nuclear power plant, or when life-or-death decisions are involved. Third, when the ML system does make errors, as it almost inevitably will, diagnosing and correcting exactly what’s going wrong can be difficult. The underlying structure that led to the solution can be unimaginably complex, and the solution may be far from optimal if the conditions under which the system was trained change. While all these risks are very real, the appropriate is not perfection but the best available alternative. After all, we humans, too, have biases, make mistakes, and have trouble explaining truthfully how we arrived at particular decision. The advantage of machine-based systems is that they can be improved over time and will give consistent answers when presented with the same data. Does that mean there is no limit to what artificial intelligence and machine learning can do? Perception and cognition cover great deal of territory from driving car to forecasting sales to deciding whom to hire or promote. We believe the chances are excellent that AI will soon reach superhuman levels of performance in most or all of these areas. So what We sometimes hear intelligence will never be good at assessing emotional, crafty, sly, inconsistent human beings it’s too rigid and impersonal for We don’t agree. ML systems like those at Affectiva are already at or beyond human-level performance in discerning person’s emotional state on the basis of tone of voice or facial expression. Other systems can infer when even the world’s best poker players are bluffing well enough to beat them at the amazingly complex game Heads-up No-Limit Texas Hold’em. Reading people accurately is subtle work, but it’s not magic. It requires perception and cognition exactly the areas in which ML is currently strong and getting stronger all the time. great place to start discussion of the limits of AI is with Pablo Picasso’s observation about computers: they are useless. They can only give you They’re actually far from useless, as ML’s recent show, but Picasso’s observation still provides insight. Computers are devices for answering questions, not for posing them. That means entrepreneurs, innovators, scientists, creators, and other kinds of people who figure out what problem or opportunity to tackle next, or what new territory to explore, will continue to be essential. Similarly, there’s huge difference between passively assessing someone’s mental state or morale and actively working to change it. ML systems are getting quite good at the former but remain well behind us at the latter. We humans are deeply social species; other humans, not machines, are best at tapping into social drives such as compassion, pride, solidarity, and shame in order to persuade, motivate, and inspire. In the TED Conference and the XPrize Foundation We think the biggest and most important opportunities for human smarts in this new age of superpowerful ML lie at the intersection of two areas: figuring out what problems to work on next, and persuading lot of people to tackle them and go along with the solutions. This is decent definition of leadership, which is becoming much more important in the second machine age. The status quo of dividing up work between minds and machines is falling apart very quickly. Companies that stick with it are going to find themselves at an ever-greater competitive disadvantage compared with rivals who are willing and able to put ML to use in all the places where it is appropriate and who can figure out how to effectively integrate its capabilities with humanity’s. time of tectonic change in the business world has begun, brought on by technological progress. As was the case with steam power and electricity, it’s not access to the new technologies themselves, or even to the best technologists, that separates winners from losers. Instead, it’s innovators who are open-minded enough to see past the status quo and envision very different approaches, and savvy enough to put them into place. One of machine learning’s greatest legacies may well be the creation of new generation of business leaders. In our view, artificial intelligence, especially machine learning, is the most important general-purpose technology of our era. The impact of these innovations on business and the economy will be reflected not only in their direct contributions but also in their ability to enable and inspire complementary innovations. New products and processes are being made possible by better vision systems, speech recognition, intelligent problem solving, and many other capabilities that machine learning delivers. Some experts have gone even further. Gil Pratt, who now heads the Toyota Research Institute, has compared the current wave of AI technology to the Cambrian explosion million years ago that birthed tremendous variety of new life forms. Then as now, one of the key new capabilities was vision. When animals first gained this capability, it allowed them to explore the environment far more effectively; that catalyzed an enormous increase in the number of species, both predators and prey, and in the range of ecological niches that were filled. Today as well we expect to see variety of new products, services, processes, and organizational forms and also numerous extinctions. There will certainly be some weird failures along with unexpected successes. Although it is hard to predict exactly which companies will dominate in the new environment, general principle is clear: The most nimble and adaptable companies and executives will thrive. Organizations that can rapidly sense and respond to opportunities will seize the advantage in the AI-enabled So the successful strategy is to be willing to experiment and learn quickly. If managers aren’t ramping up experiments in the area of machine learning, they aren’t doing their job. Over the next decade, AI won’t replace managers, but managers who use AI will replace those who don’t.", 
                    "text lines": "The term artificial intelligence was coined in 1955 by John McCarthy, a math \nprofessor at Dartmouth who organized the seminal conference on the topic the ...", 
                    "link": "https://hbr.org/cover-story/2017/07/the-business-of-artificial-intelligence", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902750.91849, 
                    "title": "Artificial Intelligence – What it is and why it matters | SAS", 
                    "abstract": "Early AI research in the explored topics like problem solving and symbolic methods. In the the US Department of Defense took interest in this type of work and began training computers to mimic basic human reasoning. For example, the Defense Advanced Research Projects Agency completed street mapping projects in the And DARPA produced intelligent personal assistants in long before Siri, Alexa or Cortana were household names. While Hollywood movies and science fiction novels depict AI as human-like robots that take over the world, the current evolution of AI technologies isn’t that scary or quite that smart. Instead, AI has evolved to provide many specific benefits in every industry. Keep reading for modern examples of artificial intelligence in health care, retail and more. to existing products. In most cases, AI will not be sold as an individual application. Rather, products you already use will be improved with AI capabilities, much like Siri was added as feature to new generation of Apple products. Automation, conversational platforms, bots and smart machines can be combined with large amounts of data to improve many technologies at home and in the from security intelligence to investment analysis. to let the data do the programming. AI finds structure and regularities in data so that the algorithm acquires skill: The algorithm becomes classifier or predicator. So, just as the algorithm can teach itself how to play chess, it can teach itself what product to recommend next online. And the models adapt when given new data. Back propagation is an AI technique that allows the model to adjust, through training and added data, when the first answer is not quite right. using neural networks that have many hidden layers. Building fraud detection system with five hidden layers was almost impossible few years ago. All that has changed with incredible computer power and big data. You need lots of data to train deep learning models because they learn directly from the data. The more data you can feed them, the more accurate they become. though deep neural networks which was previously impossible. For example, your interactions with Alexa, Google Search and Google Photos are all based on deep learning and they keep getting more accurate the more we use them. In the medical field, AI techniques from deep learning, image classification and object recognition can now be used to find cancer on MRIs with the same accuracy as highly trained radiologists. When are self-learning, the data itself can become intellectual property. The answers are in the data; you just have to apply AI to get them out. Since the role of the data is now more important than ever before, it can create competitive advantage. If you have the best data in competitive industry, even if everyone is applying similar techniques, the best data will win. Today’s AI systems are trained to do clearly defined task. The system that plays poker cannot play solitaire or chess. The system that detects fraud cannot drive car or give you legal advice. In fact, an AI system that detects health care fraud cannot accurately detect tax fraud or warranty claims fraud.", 
                    "text lines": "Artificial Intelligence History. The term artificial intelligence was coined in 1956, but AI has become more popular today thanks to increased data volumes, advanced algorithms, and improvements in computing power and storage. Early AI research in the 1950s explored topics like problem solving and symbolic methods.", 
                    "link": "https://www.sas.com/en_us/insights/analytics/what-is-artificial-intelligence.html", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902751.303203, 
                    "title": "Brain-Based Circuitry Just Made Artificial Intelligence A Whole Lot ...", 
                    "abstract": "with circuits that even more closely resemble neurons. When they tested an AI algorithm on the new type of circuitry, they found that it performed as well as conventional neural nets already in use. But! the new integrated neural net system completed the task with times less energy than conventional AI algorithm. If these new neuron-based circuits take off, artificial intelligence researchers will soon be able to do lot more computing with lot less energy. Like using tin can to communicate with an actual telephone, computer chips and neural net just speak two different languages, and work slower as result. But in the new system, the hardware and software were built to work perfectly together. So the new AI system completed the tasks much faster than conventional system, without any drop in accuracy. This is step up from previous to make silicon-based neural networks. Usually, the AI systems built on these sorts of neuron-inspired chips don’t usually work as well as conventional artificial intelligence. But the new research modeled two types of neurons: one that was geared for quick computations and another that was designed to store long-term memory, the researchers But even so, the researchers behind the new artificial neural hardware have been able to glean important lessons from how our brains work and apply it to computer science. In that sense, they have figured out how to further artificial intelligence by cherry-picking what our brains have to offer without getting weighed down trying to rebuild the whole darn thing.", 
                    "text lines": "17 hours ago ... By pairing neural network algorithms with circuits modeled after the structure of \nthe human brain, artificial intelligence works 100 times more ...", 
                    "link": "https://futurism.com/brain-based-circuitry-just-made-artificial-intelligence-faster/", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902751.662128, 
                    "title": "What is AI (artificial intelligence)? - Definition from WhatIs.com", 
                    "abstract": "AI intelligence) is the simulation of human intelligence processes by machines, especially computer systems. These processes include learning acquisition of information and rules for using the reasoning the rules to reach approximate or definite conclusions) and self-correction. Particular applications of AI include expert systems, speech recognition and machine vision. chess program that beat Garry Kasparov in the Deep Blue can identify pieces on the chess board and make predictions, but it has no memory and cannot use past experiences to inform future ones. It analyzes possible moves its own and its opponent and chooses the most strategic move. Deep Blue and Google's AlphaGO were designed for narrow purposes and cannot easily be applied to another situation. is the science of making computers see. Machine vision captures and analyzes visual information using camera, analog-to-digital conversion and digital signal processing. It is often compared to human eyesight, but machine vision isn't bound by biology and can be programmed to see through walls, for example. It is used in range of applications from signature identification to medical image analysis. Computer vision, which is focused on machine-based image processing, is often conflated with machine vision. is the processing of human and not computer language by computer program. One of the older and best known examples of NLP is spam detection, which looks at the subject line and the text of an email and decides if it's junk. Current approaches to NLP are based on machine learning. NLP tasks include text translation, sentiment analysis and speech recognition. is field of engineering focused on the design and manufacturing of robots. Robots are often used to perform tasks that are difficult for humans to perform or perform consistently. They are used in assembly lines for car production or by NASA to move large objects in space. More recently, researchers are using machine learning to build robots that can interact in social settings. Robotic process automation is being applied to highly repetitive tasks normally performed by humans. Machine learning are being integrated into analytics and CRM platforms to uncover information on how to better serve customers. Chatbots have been incorporated into websites to provide immediate service to customers. Automation of job positions has also become talking point among academics and IT consultancies such as Gartner and Forrester. AI can automate grading, giving educators more time. AI can assess students and adapt to their needs, helping them work at their own pace. AI tutors can provide additional support to students, ensuring they stay on track. AI could change where and how students learn, perhaps even replacing some teachers.", 
                    "text lines": "AI (artificial intelligence) is the simulation of human intelligence processes by machines, especially computer systems.", 
                    "link": "https://searchenterpriseai.techtarget.com/definition/AI-Artificial-Intelligence", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902752.640206, 
                    "title": "What is Artificial Intelligence (AI)? - Definition from Techopedia", 
                    "abstract": "Knowledge engineering is core part of AI research. Machines can often act and react like humans only if they have abundant information relating to the world. Artificial intelligence must have access to objects, categories, properties and relations between all of them to implement knowledge engineering. Initiating common sense, reasoning and problem-solving power in machines is difficult and tedious task. Machine learning is also core part of AI. Learning without any kind of supervision requires an ability to identify patterns in streams of inputs, whereas learning with adequate supervision involves classification and numerical regressions. Classification determines the category an object belongs to and regression deals with obtaining set of numerical input or output examples, thereby discovering functions enabling the generation of suitable outputs from respective inputs. Mathematical analysis of machine learning and their performance is well-defined branch of theoretical computer science often referred to as computational learning theory.", 
                    "text lines": "Artificial intelligence (AI) is an area of computer science that emphasizes the \ncreation of intelligent machines that work and react like humans. Some of the ...", 
                    "link": "https://www.techopedia.com/definition/190/artificial-intelligence-ai", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902753.590487, 
                    "title": "Artificial Intelligence - Journal - Elsevier", 
                    "abstract": "CiteScore measures the average citations received per document published in this title. CiteScore values are based on citation counts in given year to documents published in three previous calendar years divided by the number of documents in these three previous years also invites papers on applications, which should describe principled solution, emphasize its novelty, and present an in-depth evaluation of the AI techniques being exploited. The journal publishes an annual issue devoted to survey articles and also hosts section\" devoted to reporting results from AI competitions. From time to time, there are special issues devoted to particular topic; such special issues always have open calls.", 
                    "text lines": "Artificial Intelligence, which commenced publication in 1970, is now the generally \naccepted premier international forum for the publication of results of current ...", 
                    "link": "https://www.journals.elsevier.com/artificial-intelligence", 
                    "processed": true
                }, 
                {
                    "time of visit": 1528902753.668353, 
                    "title": "Artificial Intelligence - AI Definition | Investopedia", 
                    "abstract": "", 
                    "text lines": "Artificial intelligence (AI) refers to simulated intelligence in machines that have \nbeen programmed to mimic human action and rational thought.", 
                    "link": "https://www.investopedia.com/terms/a/artificial-intelligence-ai.asp", 
                    "processed": true
                }
            ], 
            "banned keywords": [], 
            "keywords": [
                "artificial", 
                "intelligence"
            ], 
            "persistent keywords": [
                "artificial", 
                "intelligence"
            ], 
            "second-tier keywords": [], 
            "iteration number": 0, 
            "first-tier keywords": [], 
            "search time": 1528902748.674484
        }, 
        {
            "removed keywords": [], 
            "banned keywords": [], 
            "keywords": [
                "artificial", 
                "intelligence", 
                "improvement", 
                "mi"
            ], 
            "persistent keywords": [
                "artificial", 
                "intelligence"
            ], 
            "second-tier keywords": [
                "intelligence refers", 
                "technique", 
                "situation", 
                "previous", 
                "telephone", 
                "silicon-based", 
                "resemble", 
                "important", 
                "technology", 
                "principled", 
                "difficult", 
                "researcher", 
                "recognition", 
                "contrast", 
                "specific", 
                "well-defined", 
                "particular", 
                "long-term", 
                "automation", 
                "generation", 
                "theoretical", 
                "translation", 
                "classification", 
                "neuron-inspired", 
                "supervision", 
                "algorithm", 
                "accuracy", 
                "possible", 
                "hardware", 
                "information", 
                "strategic", 
                "neuron-based", 
                "previous calendar", 
                "warranty", 
                "applications", 
                "impossible", 
                "techniques", 
                "self-driving", 
                "integrated", 
                "scientist", 
                "journal", 
                "performance", 
                "in-depth evaluation", 
                "symbolic", 
                "structure", 
                "detection", 
                "solitaire", 
                "simulation", 
                "document", 
                "suitable", 
                "computer", 
                "competitions", 
                "different languages", 
                "self-learning", 
                "conventional", 
                "computation", 
                "predictions", 
                "respective", 
                "citescore", 
                "circuitry", 
                "platform", 
                "weakness", 
                "citation", 
                "verification", 
                "manufacturing", 
                "immediate", 
                "experience", 
                "interaction", 
                "regression", 
                "industry", 
                "validity", 
                "evolution", 
                "validation", 
                "testament", 
                "customers", 
                "problem-solving", 
                "sentiment analysis", 
                "building", 
                "approach", 
                "analytics", 
                "additional", 
                "potential", 
                "workfusion’s", 
                "possibility", 
                "technical standard", 
                "capabilities", 
                "mathematical", 
                "technical", 
                "workfusion", 
                "tabloids", 
                "research", 
                "waveform", 
                "self-correction", 
                "szilard’s invention", 
                "systematic", 
                "verifiable expertise", 
                "sympathize", 
                "necessary", 
                "valuable", 
                "categories", 
                "unsupervised", 
                "sustainable", 
                "superintelligent", 
                "regularity", 
                "universities", 
                "superintelligence", 
                "repetitive", 
                "superhuman", 
                "understanding", 
                "underappreciated", 
                "transportation", 
                "super-wealthy", 
                "transformational", 
                "topcoder", 
                "threshold", 
                "intelligent", 
                "reasoning", 
                "super-intelligent", 
                "threefold", 
                "strongest", 
                "insurance", 
                "thousand", 
                "stone-age computers", 
                "radiologists", 
                "task-and-occupation", 
                "targeting", 
                "supervised", 
                "something", 
                "software industry", 
                "sufficient accuracy", 
                "production", 
                "significant", 
                "processing", 
                "successful", 
                "short-term challenge", 
                "successes", 
                "schopenhauer", 
                "environment", 
                "rutherford", 
                "researchers", 
                "economics", 
                "propagation", 
                "opponent", 
                "distribution", 
                "programming", 
                "research initiative", 
                "striking", 
                "products", 
                "representation", 
                "regulators", 
                "connection", 
                "stanford", 
                "machine-based", 
                "competence", 
                "kasparov", 
                "intelligence", 
                "predicator", 
                "personal assistant", 
                "forrester", 
                "eyesight", 
                "investment analysis", 
                "singapore", 
                "intelligent personal", 
                "application", 
                "intellectual", 
                "incredible computer", 
                "engineering", 
                "schussel", 
                "conclusions", 
                "salesperson", 
                "human-like", 
                "computer language", 
                "hollywood", 
                "explored", 
                "chatbots", 
                "approximate", 
                "analysis", 
                "acquisition", 
                "everyone", 
                "academic", 
                "regulator", 
                "regulation", 
                "department", 
                "competitive industry", 
                "classifier", 
                "purposes", 
                "pseudo-controversies", 
                "prominent", 
                "accurate", 
                "programmer drinking", 
                "probability", 
                "salesforce", 
                "principle", 
                "retailing", 
                "powerful computer", 
                "resolution", 
                "possibilities", 
                "pitfalls", 
                "physicist", 
                "philosophy", 
                "pacemaker", 
                "overpopulation", 
                "over-hyped", 
                "outsmart", 
                "out-of-context", 
                "out-manipulating", 
                "out-inventing", 
                "optimistic", 
                "reinvention", 
                "reinforcement", 
                "reference", 
                "noncompliance", 
                "recording", 
                "recommendation", 
                "non-negligible", 
                "neuroscience", 
                "nathaniel rochester", 
                "motivates research", 
                "monitoring", 
                "radiologist", 
                "quantification", 
                "puppies’", 
                "programmer", 
                "profitable", 
                "misunderstanding", 
                "professor", 
                "productivity", 
                "misconception", 
                "milestones", 
                "mechanism", 
                "mccarthy", 
                "productive", 
                "processes", 
                "marketable", 
                "malevolence", 
                "procedure", 
                "machine-produced", 
                "leadership", 
                "language", 
                "journalist", 
                "prediction", 
                "irreversible", 
                "irrelevant", 
                "powerful", 
                "investment", 
                "interplanetary", 
                "interface technical", 
                "polymath", 
                "polanyi’s", 
                "industry stakeholder", 
                "placement", 
                "industrialized", 
                "individual’s", 
                "inadvertent", 
                "physicians", 
                "impressive", 
                "photograph", 
                "hydroelectric", 
                "humanity", 
                "human-level", 
                "helicopter", 
                "heat-seeking", 
                "friendly", 
                "philosopher", 
                "frequency", 
                "financial", 
                "explained", 
                "performs", 
                "exclusion", 
                "evil-looking", 
                "perception", 
                "pedestrian", 
                "eventuality", 
                "enormous engagement", 
                "emergence", 
                "electron", 
                "organizational", 
                "organization", 
                "electromagnetic", 
                "ecosystem", 
                "optimization", 
                "economic liability", 
                "opportunity", 
                "opportunities", 
                "occupations", 
                "networks", 
                "motivated", 
                "driverless", 
                "mathematics", 
                "managerial economics", 
                "management", 
                "machine’s", 
                "lumidatum", 
                "lighting conditions", 
                "lawnmowers", 
                "disagree", 
                "direction", 
                "laundering", 
                "knowledge", 
                "difference", 
                "developing", 
                "determinant", 
                "definition", 
                "declaration", 
                "counter-myth", 
                "corruption", 
                "conversation", 
                "judgment", 
                "controversy", 
                "controversial", 
                "continued", 
                "jpmorgan", 
                "consumer", 
                "inventory", 
                "introductory", 
                "consequence", 
                "introduction", 
                "consciousness", 
                "conscious", 
                "interpretation", 
                "confidence", 
                "international", 
                "interested", 
                "conclusion", 
                "compliance", 
                "intangibles", 
                "intangible", 
                "commonplace", 
                "collective", 
                "cognitive apparatus", 
                "civilization", 
                "initiative", 
                "casualties", 
                "industrial-grade", 
                "inability", 
                "bio-signal interface", 
                "implementation", 
                "beneficial-ai", 
                "imagination", 
                "beneficial motivates", 
                "behaviour", 
                "google’s deepmind", 
                "bandwidth", 
                "balanced", 
                "fundraising", 
                "available products", 
                "autonomy", 
                "autonomous", 
                "astronomer", 
                "fundamental", 
                "fulfillment", 
                "approval", 
                "friend’s", 
                "friends’", 
                "anything", 
                "ant-hater", 
                "flawless", 
                "ambitious", 
                "facebook", 
                "ever-lower", 
                "environments", 
                "entertainment", 
                "electricity", 
                "efficient", 
                "efficiency", 
                "effectiveness", 
                "effective", 
                "educational", 
                "education", 
                "economist", 
                "economic", 
                "division", 
                "distortion", 
                "discovery", 
                "different approach", 
                "different", 
                "development", 
                "developers’", 
                "deployments", 
                "deep-learning", 
                "cybersecurity", 
                "customers’", 
                "currency", 
                "critical", 
                "confusion", 
                "confident", 
                "competition", 
                "combustion", 
                "colleague", 
                "cognitive", 
                "cognition", 
                "cofounder sebastian", 
                "classifications", 
                "character", 
                "capability available", 
                "bundling", 
                "brazilian", 
                "bottleneck", 
                "big-box retailers", 
                "behaviors", 
                "behavior", 
                "back-office", 
                "available", 
                "associate", 
                "assistant", 
                "aptonomy", 
                "applicability", 
                "amazon’s", 
                "allowable", 
                "airplanes", 
                "ai-based", 
                "advertising", 
                "advantage", 
                "activity", 
                "activities", 
                "achievement"
            ], 
            "iteration number": 1, 
            "first-tier keywords": [
                "improvement", 
                "mi"
            ]
        }
    ]
}